package OOP_Homework_1;

import java.util.ArrayList;
import java.util.List;

/**
 * И так у нас есть список в который записывается экземпляр класса FamilyComposition который содержит в себя
 * данные по главе семьи его жене и списки их детей причем отдельно мальчиков и девочек
 * Теперь нужно реализовать интерфейс для заполнения ДРЕВА
 * Что должно произойти при запуски программы - это отдельный интерфейс программы но призапуске программы должно быть МЕНЮ
 * Просмотреть существующие записи, добавить запись
 * а при просмотре записи должно показывать что
 */
public class InterfaceTreeCell {




}
